{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend with no logic implemented.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (reel feed, reel card UI, top nav, mock data) to their source files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "JSON dictionary of one-line summaries for each frontend source file, describing the purpose of every component, hook, type, and config file in the project.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH CSS custom properties for light and dark color themes including background, foreground, accent, chart, and sidebar tokens.",
  "frontend/index.html": "Minimal HTML entry point with a root div and a module script tag loading the React app; title still references the original 3D car game.",
  "frontend/src/App.tsx": "Root app component that composes TopNav and ReelFeed in a full-screen dark layout and renders a fixed footer attribution link.",
  "frontend/src/components/ActionIcons.tsx": "Vertical action bar with like, comment, share, and save buttons; manages local toggle state for like/save and formats large counts into K/M notation.",
  "frontend/src/components/ReelCard.tsx": "Full-screen reel card component with looping video playback, gradient fallback, play/pause/mute controls, overlaid metadata, tags, and right-side ActionIcons.",
  "frontend/src/components/ReelFeed.tsx": "Vertical snap-scroll feed that renders all mockReels as ReelCard components, tracks the active index via scroll events, and passes isActive for autoplay control.",
  "frontend/src/components/TopNav.tsx": "Fixed top navigation bar with a logo, three tab buttons (Following, For You, Explore) with orange accent active state, and search/create icon buttons.",
  "frontend/src/data/mockReels.ts": "Exports an array of six mock Reel objects with sample video URLs, metadata (title, description, author, stats), and tags for use in development/testing.",
  "frontend/src/game/Car.tsx": "Empty file intended to contain the 3D car component for the React Three Fiber driving game.",
  "frontend/src/game/CarGame.tsx": "Empty file intended to contain the main 3D car game scene/canvas component.",
  "frontend/src/game/Environment.tsx": "Empty file intended to contain the 3D environment/track component for the car game.",
  "frontend/src/game/GameState.ts": "Empty file intended to define game state types or management logic for the car driving game.",
  "frontend/src/game/HUDOverlay.tsx": "Empty file intended to contain the HUD overlay UI component displaying speed and control instructions.",
  "frontend/src/game/MenuOverlay.tsx": "Empty file intended to contain the start/pause/restart menu overlay UI component for the game.",
  "frontend/src/game/physics.ts": "Empty file intended to contain arcade driving physics logic (acceleration, friction, steering).",
  "frontend/src/game/useFollowCamera.ts": "Empty file intended to contain a custom hook for the third-person follow camera that tracks the car.",
  "frontend/src/game/useKeyboardControls.ts": "Empty file intended to contain a custom hook for capturing keyboard input (WASD/arrow keys) for car controls.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY Internet Identity authentication, including login, logout, and persisted identity state via AuthClient.",
  "frontend/src/index.css": "Global CSS file that defines OKLCH-based dark-theme CSS variables, imports Inter and Syne fonts, applies Tailwind base/components/utilities, and adds scrollbar-hide and line-clamp utility classes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/types/reel.ts": "Defines the Reel TypeScript interface with fields for id, title, description, author info, video URL, engagement stats, and tags.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with OKLCH CSS-variable-based colors, Inter/Syne font families, custom border radii, glow box shadows, and fade/slide animations.",
  "project_state.json": "Project state manifest (version 5) tracking the summary, existing features, and image requirements for a reel/short-video app with a 3D car driving game feature."
}